Table of Contents
 Interface IIdeaConnectionPoint
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represent connection point with all connected items
public interface IIdeaConnectionPoint : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 AnchorGrids
IEnumerable<IIdeaAnchorGrid> AnchorGrids { get; }
Property Value
IEnumerable<IIdeaAnchorGrid>
 BoltGrids
IEnumerable<IIdeaBoltGrid> BoltGrids { get; }
Property Value
IEnumerable<IIdeaBoltGrid>
 ConnectedMembers
IEnumerable<IIdeaConnectedMember> ConnectedMembers { get; }
Property Value
IEnumerable<IIdeaConnectedMember>
 Cuts
IEnumerable<IIdeaCut> Cuts { get; }
Property Value
IEnumerable<IIdeaCut>
 FoldedPlates
IEnumerable<IIdeaFoldedPlate> FoldedPlates { get; }
Property Value
IEnumerable<IIdeaFoldedPlate>
 Node
IIdeaNode Node { get; }
Property Value
IIdeaNode
 Plates
IEnumerable<IIdeaPlate> Plates { get; }
Property Value
IEnumerable<IIdeaPlate>
 Welds
IEnumerable<IIdeaWeld> Welds { get; }
Property Value
IEnumerable<IIdeaWeld>
 Edit this page